/****************************************Copyright (c)****************************************************
**                                          
**
**
**--------------File Info---------------------------------------------------------------------------------
** File name:           main.c
** Last modified Date:  2015-3-15
** Last Version:        V1.0
** Descriptions:        The main() function 
**
**--------------------------------------------------------------------------------------------------------
** Created by:          Zhou Sihang
** Created date:        2015-3-15
** Version:             V1.00
** Descriptions:        气体浓度计
**
**--------------------------------------------------------------------------------------------------------
** Modified by:         
** Modified date:       
** Version:             
** Descriptions:        
**
**--------------------------------------------------------------------------------------------------------
** Modified by:        
** Modified date:      
** Version:            
** Descriptions:       
**
** Rechecked by:
*********************************************************************************************************/
#include "LPC11xx.h"                                                    /* LPC11xx外设寄存器            */
#include "SHT10.h"
#include "init.h"

uint8_t val_1,val_2=0;
float temp=0;

/*********************************************************************************************************
** Function name:       main
** Descriptions:        无
** input parameters:    无
** output parameters:   无
** Returned value:      无
*********************************************************************************************************/
int main (void)
{
    uint8_t i = 0;
    SystemInit();                                                       /* 系统初始化，切勿删除         */
    GPIOInit();
    myDelay(20);                                                        //上电之后需要等待11ms以越过“休眠”状态
    while (1) 
    {
        s_transstart();
        s_write_byte(MEASURE_TEMP);
        for(i=0;i<2000;i++)
        {
            __nop();
            if(!(LPC_GPIO2->DATA & DATAHIGH))break;
        }
        val_1 = s_read_byte(ACK);
        val_2 = s_read_byte(noACK);
        temp = (float)((int)val_1*256+(int)val_2)/100-40.00;
        myDelay(500);
    }
}

/*********************************************************************************************************
End Of File
*********************************************************************************************************/
